; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 2151)
	(= (fuel plane1) 54)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city6)
	(= (capacity plane2) 6428)
	(= (fuel plane2) 1287)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at person1 city2)
	(at person2 city4)
	(at person3 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 598)
	(= (distance city0 city2) 742)
	(= (distance city0 city3) 893)
	(= (distance city0 city4) 645)
	(= (distance city0 city5) 945)
	(= (distance city0 city6) 686)
	(= (distance city1 city0) 598)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 746)
	(= (distance city1 city3) 950)
	(= (distance city1 city4) 802)
	(= (distance city1 city5) 854)
	(= (distance city1 city6) 778)
	(= (distance city2 city0) 742)
	(= (distance city2 city1) 746)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 793)
	(= (distance city2 city4) 808)
	(= (distance city2 city5) 708)
	(= (distance city2 city6) 749)
	(= (distance city3 city0) 893)
	(= (distance city3 city1) 950)
	(= (distance city3 city2) 793)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 659)
	(= (distance city3 city5) 670)
	(= (distance city3 city6) 674)
	(= (distance city4 city0) 645)
	(= (distance city4 city1) 802)
	(= (distance city4 city2) 808)
	(= (distance city4 city3) 659)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 589)
	(= (distance city4 city6) 781)
	(= (distance city5 city0) 945)
	(= (distance city5 city1) 854)
	(= (distance city5 city2) 708)
	(= (distance city5 city3) 670)
	(= (distance city5 city4) 589)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 885)
	(= (distance city6 city0) 686)
	(= (distance city6 city1) 778)
	(= (distance city6 city2) 749)
	(= (distance city6 city3) 674)
	(= (distance city6 city4) 781)
	(= (distance city6 city5) 885)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city5)
	(at person2 city0)
	(at person3 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person3 plane2 city6)
   deleted: (at person3 city6)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 3
2. (refuel plane2 city6)
   changed: (fuel plane2) from 1287 to 6428
   goals met: 0 of 3
3. (fly plane2 city6 city2)
   deleted: (at plane2 city6)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 2247, (fuel plane2) from 6428 to 4181
   goals met: 0 of 3
4. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 3
5. (fly plane2 city2 city4)
   deleted: (at plane2 city2)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 2247 to 4671, (fuel plane2) from 4181 to 1757
   goals met: 0 of 3
6. (debark person3 plane2 city4)
   deleted: (in person3 plane2)
   added: (at person3 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 1 of 3
7. (board person2 plane2 city4)
   deleted: (at person2 city4)
   added: (in person2 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 3
8. (refuel plane2 city4)
   changed: (fuel plane2) from 1757 to 6428
   goals met: 1 of 3
9. (fly plane2 city4 city5)
   deleted: (at plane2 city4)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 4671 to 6438, (fuel plane2) from 6428 to 4661
   goals met: 1 of 3
10. (debark person1 plane2 city5)
   deleted: (in person1 plane2)
   added: (at person1 city5)
   changed: (onboard plane2) from 2 to 1
   goals met: 2 of 3
11. (fly plane2 city5 city0)
   deleted: (at plane2 city5)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 6438 to 9273, (fuel plane2) from 4661 to 1826
   goals met: 2 of 3
12. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 3
